# 색상 유사어 사전 및 대표 색상 코드 - 무신사 기준
color_synonyms = {
    "블랙": ["검정", "검은색", "차콜", "다크 그레이","검정색","까만","깜장","깜장색","검은"],
    "화이트": ["흰색", "하얀색","흰","하얀"],
    "아이보리": ["아이보리", "크림", "밀크", "에크루"],
    "네이비": ["네이비", "남색", "네이비 블루", "미드나잇 블루"],
    "라이트 그레이": ["라이트 그레이", "밝은 회색"],
    "그레이": ["회색", "그레이", "애쉬","쥐색"],
    "다크 그레이": ["다크 그레이", "짙은 회색"],
    "블루": ["파랑", "파랑색", "파란색", "블루", "네이비 블루","파란"],
    "스카이블루": ["하늘색", "스카이 블루","연파랑"],
    "베이지": ["베이지", "샴페인", "오트밀"],
    "그린": ["초록", "초록색", "녹색", "그린", "헌터 그린", "포레스트 그린", "애플 그린", "피스타치오", "에메랄드", "말라카이트", "피스타치오 그린"],
    "핑크": ["분홍", "분홍색", "핑크", "핫 핑크", "푸시아", "로즈", "마젠타", "라벤더 블러쉬"],
    "카키": ["카키", "올리브", "올리브 드랩", "다크그린"],
    "라이트핑크": ["라이트핑크", "밝은 분홍"],
    "브라운": ["갈색", "브라운", "카멜", "코코아", "탄", "초콜릿"],
    "민트": ["민트", "연두", "라임", "네온 그린", "차트레즈"],
    "레드": ["빨강", "빨강색", "빨간색", "레드", "와인", "라즈베리", "자두", "블러드 레드", "딥레드"],
    "옐로우": ["노랑", "노랑색", "노란색", "옐로우", "라이트옐로우", "골드", "머스터드"],
    "샌드": ["샌드"],
    "오렌지": ["주황", "주황색", "오렌지", "코랄", "살구"],
    "퍼플": ["보라", "보라색", "퍼플", "바이올렛"],
    "라이트옐로우": ["라이트옐로우", "밝은 노랑"],
    "라벤더": ["라벤더", "라일락", "연보라"],
    "다크그린": ["다크그린", "어두운 초록", "진녹색"],
    "라이트 그린": ["라이트 그린", "밝은 초록", "연녹색"],
    "올리브그린": ["올리브그린", "카키 그린", "카키"],
    "페일 핑크": ["페일 핑크", "연분홍"],
    "버건디": ["버건디", "와인", "딥레드"],
    "데님": ["데님", "청색"],
    "카멜": ["카멜", "황갈색"],
    "딥레드": ["딥레드", "와인"],
    "연청": ["연청", "밝은 청색", "스카이 블루"],
    "카키베이지": ["카키베이지"],
    "흑청": ["흑청", "블랙 데님", "검정 데님"],
    "실버": ["실버", "은색", "플래티넘"],
    "중청": ["중청"],
    "진청": ["진청", "어두운 청색", "네이비 데님"]
}

# 대표 색상 코드
colors = {
    "블랙": "#000000",
    "화이트": "#FFFFFF",
    "아이보리": "#FFFFF0",
    "네이비": "#000080",
    "라이트 그레이": "#D3D3D3",
    "그레이": "#808080",
    "다크 그레이": "#A9A9A9",
    "블루": "#0000FF",
    "스카이블루": "#87CEEB",
    "베이지": "#F5F5DC",
    "그린": "#008000",
    "핑크": "#FFC0CB",
    "카키": "#F0E68C",
    "라이트핑크": "#FFB6C1",
    "브라운": "#A52A2A",
    "민트": "#98FF98",
    "레드": "#FF0000",
    "옐로우": "#FFFF00",
    "샌드": "#C2B280",
    "오렌지": "#FFA500",
    "퍼플": "#800080",
    "라이트옐로우": "#FFFFE0",
    "라벤더": "#E6E6FA",
    "다크그린": "#006400",
    "라이트 그린": "#90EE90",
    "올리브그린": "#556B2F",
    "페일 핑크": "#FADADD",
    "버건디": "#800020",
    "데님": "#1560BD",
    "카멜": "#C19A6B",
    "딥레드": "#8B0000",
    "연청": "#B0E0E6",
    "카키베이지": "#C3B091",
    "흑청": "#696969",
    "실버": "#C0C0C0",
    "중청": "#4682B4",
    "진청": "#2C3E50"
}

sleeve_types = {
    "긴팔": ["긴팔", "긴소매", "롱슬리브", "긴팔 티셔츠", "긴팔티"],
    "반팔": ["반팔", "반소매", "반팔 티셔츠", "반팔티"]
}

pants_types = {
    "긴바지": ["긴바지", "바지", "롱팬츠", "긴 팬츠"],
    "반바지": ["반바지", "숏팬츠", "쇼츠", "반바지 팬츠"]
}

top_types = {
    "니트": ["니트", "스웨터", "니트 스웨터"],
    "셔츠": ["셔츠", "와이셔츠", "드레스 셔츠", "남방", "셔츠 남방"],
    "카라셔츠": ["카라티셔츠", "카라티", "폴로 셔츠", "폴로티","카라"],
    "후드티": ["후드티", "후드", "후드 스웨터", "후디"],
    "맨투맨": ["맨투맨", "맨투맨 티셔츠", "맨투맨 티"],
    "블라우스": ["블라우스", "셔츠 블라우스"],
    "면티": ["면티","면 티셔츠", "면","티"],
    "원피스": ["원피스", "드레스", "롱원피스", "짧은 원피스"]
}

bottom_types = {
    "청바지": ["청바지", "데님", "데님 팬츠"],
    "면바지": ["면바지", "면 팬츠"],
    "슬랙스": ["슬랙스", "정장 바지", "정장 슬랙스"],
    "치마": ["치마", "스커트", "롱스커트", "미니스커트"],
    "카고팬츠": ["카고팬츠", "카고", "카고바지", "카고 팬츠"],
    "트레이닝": ["트레이닝팬츠", "트레이닝", "운동 바지", "운동 팬츠"]
}

patterns = {
    "단색": ["단색", "무지", "솔리드"],
    "프린팅": ["드로잉", "그림", "일러스트","로고", "그래픽", "프린트"],
    "스트라이프": ["스트라이프", "줄무늬", "세로줄", "가로줄"],
    "도트": ["도트", "물방울", "땡땡이", "점무늬"],
    "체크": ["체크", "격자", "체크무늬", "체크 패턴"],
    "플라워": ["플라워", "꽃무늬", "꽃 패턴", "플라워 패턴"]
}